// #1
//Запросите у пользователя его имя и выведите в ответ: «Привет, его имя!».

// let name = prompt ("Як тебе звати?");
// alert( "Камарджоба Братан " + name );

//#2
//Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат. Текущий год укажите в коде как константу.

// let year = prompt("рік народження ?");
// const nowYear = 2020;
// let yourYear = nowYear - year;
// alert(`Вам ${yourYear} років`);

//#3
//Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.

// let squareSideSize = prompt('який розмір сторони квадрату?');
// let squarePerimeter = (squareSideSize*4);
// alert(`Ваш периметр квадрата ${squarePerimeter}`);


//#4
//Запросите у пользователя радиус окружности и выведите площадь такой окружности.


// let circleRadius = prompt('який радіус кола?');
// let CircleArea = ( Math.PI * (circleRadius * circleRadius));
// alert(`Ваша площа кола? ${CircleArea}`);

//#5
//Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться.
// Посчитайте скорость, с которой необходимо двигаться, чтобы успеть вовремя.


// let distanse = prompt('яка відсттань між містами?');
// let time = prompt('за який час ви бажаєте добратися?');
// let speed = (`${distanse/time}`);
// alert(`твоя швидкість моє бути ${speed} km/h`);


//#6

//Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валюты храните в константе.

// const dollar = 1;
// const euro = 0.94;
// let converterValute = prompt('Введи к-сть доларів щоб конвертувати у євро');
// let Euro = (dollar*euro)*converterValute;
// alert(`${Euro} євро`);

//#7

//Пользователь указывает объем флешки в Гб. Программа должна посчитать, сколько файлов размером в 820 Мб помещается на флешку.

// const someFile = 820;
// let memoryCard = prompt('Введіть к-сть Gb вашої флешки,щоб вирахувати скільки вміститься у ній файлів розміром 820mb');
// let emountFile = (memoryCard/someFile)*1000;
// alert(`${emountFile} файлів вміститься на вашій флешці розміром 820mb`);

//#8

//Пользователь вводит сумму денег в кошельке и цену одной шоколадки.
//Программа выводит, сколько шоколадок может купить пользователь, и сколько сдачи у него останется.

//#9

//Запросите у пользователя трехзначное число и выведите его задом наперед. Для решения задачи вам понадобится оператор % (остаток от деления).





         
